<?xml version="1.0" ?>
<net batch="1" name="speaker_recognition_model.hdf5" version="6">
	<layers>
		<layer id="0" name="input" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv1/convolution" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="7,7" output="96" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>254</dim>
					<dim>248</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="9408"/>
				<biases offset="9408" size="192"/>
			</blobs>
		</layer>
		<layer id="2" name="relu1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>254</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>254</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="mpool1/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>254</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>126</dim>
					<dim>123</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv2/convolution" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="5,5" output="256" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>126</dim>
					<dim>123</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>61</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9600" size="1228800"/>
				<biases offset="1238400" size="512"/>
			</blobs>
		</layer>
		<layer id="5" name="relu2/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>61</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>61</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="mpool2/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>62</dim>
					<dim>61</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="conv3/convolution" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="384" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1238912" size="1769472"/>
				<biases offset="3008384" size="768"/>
			</blobs>
		</layer>
		<layer id="8" name="relu3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="conv4/convolution" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3009152" size="1769472"/>
				<biases offset="4778624" size="512"/>
			</blobs>
		</layer>
		<layer id="10" name="relu4/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv5/convolution" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4779136" size="1179648"/>
				<biases offset="5958784" size="512"/>
			</blobs>
		</layer>
		<layer id="12" name="relu5/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="mpool5/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="5,3" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="3,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>9</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="fc6/convolution" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="9,1" output="4096" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>9</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>1</dim>
					<dim>14</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5959296" size="18874368"/>
				<biases offset="24833664" size="8192"/>
			</blobs>
		</layer>
		<layer id="15" name="relu6/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>1</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>1</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="2207_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="24841856" size="16"/>
			</blobs>
		</layer>
		<layer id="17" name="gapool6/Mean/Reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>1</dim>
					<dim>14</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>14</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="gapool6/Mean/Pool" precision="FP16" type="Pooling">
			<data exclude-pad="false" kernel="14,1" pads_begin="0,0" pads_end="0,0" pool-method="avg" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>14</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="2209_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="24841872" size="8"/>
			</blobs>
		</layer>
		<layer id="20" name="gapool6/Mean/FinalReshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="reshape6/Reshape/shape/Concat_/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="24841880" size="16"/>
			</blobs>
		</layer>
		<layer id="22" name="reshape6/Reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4096</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="reshape6/Reshape/Transpose" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="fc7/convolution" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4096</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<weights offset="24841896" size="8388608"/>
				<biases offset="33230504" size="2048"/>
			</blobs>
		</layer>
		<layer id="25" name="relu7/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="relu7/Relu/Normalize" precision="FP16" type="Normalize">
			<data across_spatial="0" channel_shared="0" eps="1e-12"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<weights offset="33232552" size="2048"/>
			</blobs>
		</layer>
		<layer id="27" name="fc8/convolution" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<weights offset="33234600" size="2097152"/>
				<biases offset="35331752" size="2048"/>
			</blobs>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="3" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="3" to-layer="8" to-port="0"/>
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="3" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0"/>
		<edge from-layer="11" from-port="3" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="3" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="17" to-port="0"/>
		<edge from-layer="16" from-port="1" to-layer="17" to-port="1"/>
		<edge from-layer="17" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="20" to-port="0"/>
		<edge from-layer="19" from-port="1" to-layer="20" to-port="1"/>
		<edge from-layer="20" from-port="2" to-layer="22" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="22" to-port="1"/>
		<edge from-layer="22" from-port="2" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0"/>
		<edge from-layer="24" from-port="3" to-layer="25" to-port="0"/>
		<edge from-layer="25" from-port="1" to-layer="26" to-port="0"/>
		<edge from-layer="26" from-port="2" to-layer="27" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2019.3.0-408-gac8584cb7"/>
		<cli_parameters>
			<blobs_as_inputs value="False"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_experimental_IR_V10 value="False"/>
			<input_model value="DIR\kekos.hdf5.pb"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,512,500,1]"/>
			<keep_quantize_ops_in_IR value="False"/>
			<keep_shape_ops value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_shapes value="[  1 512 500   1]"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<steps value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, generate_deprecated_IR_V2, input, input_checkpoint, input_meta_graph, model_name, output, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config"/>
		</cli_parameters>
	</meta_data>
</net>
